Autodesk.Navisworks.Api.Plugins.ToolTipsAttribute
Defines tooltips for ribbon tabs and commands in the GUI system.

Autodesk.Navisworks.Api.Plugins.ToolTipsAttribute.#ctor(System.String)
Constructor
xaml:
The file that specifies the tooltips

Autodesk.Navisworks.Api.Plugins.ToolTipsAttribute.Xaml
The file that specifies the tooltips for Ribbon tab and commands